[Killed] BlockStatement
core/commons/helpers/date-time.helper.ts:2:49
 export class DateTimeHelper {
-    static toLocalISOString(date: Date): string {
-        const offsetInHours = date.getTimezoneOffset() * 60 * 1000;
-        const localDate = new Date(date.getTime() - offsetInHours);
-        const isoString = localDate.toISOString();
-        return isoString.split('.')[0].replace('T', ' ');
-    }
+    static toLocalISOString(date: Date): string {}
 }
 
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -1,7 +1,6 @@
  Object {
-   "createdAt": "2022-12-27 00:00:00",

[Survived] ArithmeticOperator
core/commons/helpers/date-time.helper.ts:3:31
 export class DateTimeHelper {
     static toLocalISOString(date: Date): string {
-        const offsetInHours = date.getTimezoneOffset() * 60 * 1000;
+        const offsetInHours = date.getTimezoneOffset() * 60 / 1000;
         const localDate = new Date(date.getTime() - offsetInHours);
         const isoString = localDate.toISOString();

[Survived] ArithmeticOperator
core/commons/helpers/date-time.helper.ts:3:31
 export class DateTimeHelper {
     static toLocalISOString(date: Date): string {
-        const offsetInHours = date.getTimezoneOffset() * 60 * 1000;
+        const offsetInHours = date.getTimezoneOffset() / 60 * 1000;
         const localDate = new Date(date.getTime() - offsetInHours);
         const isoString = localDate.toISOString();

[Survived] ArithmeticOperator
core/commons/helpers/date-time.helper.ts:4:36
 export class DateTimeHelper {
     static toLocalISOString(date: Date): string {
         const offsetInHours = date.getTimezoneOffset() * 60 * 1000;
-        const localDate = new Date(date.getTime() - offsetInHours);
+        const localDate = new Date(date.getTime() + offsetInHours);
         const isoString = localDate.toISOString();
         return isoString.split('.')[0].replace('T', ' ');

[Killed] StringLiteral
core/commons/helpers/date-time.helper.ts:6:48
         const offsetInHours = date.getTimezoneOffset() * 60 * 1000;
         const localDate = new Date(date.getTime() - offsetInHours);
         const isoString = localDate.toISOString();
-        return isoString.split('.')[0].replace('T', ' ');
+        return isoString.split('.')[0].replace("", ' ');
     }
 }
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "createdAt": "2022-12-27 00:00:00",

[Killed] StringLiteral
core/commons/helpers/date-time.helper.ts:6:53
         const offsetInHours = date.getTimezoneOffset() * 60 * 1000;
         const localDate = new Date(date.getTime() - offsetInHours);
         const isoString = localDate.toISOString();
-        return isoString.split('.')[0].replace('T', ' ');
+        return isoString.split('.')[0].replace('T', "");
     }
 }
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "createdAt": "2022-12-27 00:00:00",
