[Killed] BlockStatement
src/core/commons/get-date-time.service.ts:6:17
 
 @Injectable()
 export class GetDateTimeService implements IGetDateTimeService {
-    now(): Date {
-        return new Date();
-    }
+    now(): Date {}
 }
 
killedBy: GetDateTimeService, now() should return the current date
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Date

Received value has no prototype
Received value: undefined
