[Killed] BlockStatement
src/core/commons/optional.ts:4:35
 export class Optional<T> {
     private readonly value: T;
 
-    private constructor(value: T) {
-        this.value = value;
-    }
+    private constructor(value: T) {}
 
     public static empty<T>(): Optional<T> {
killedBy: Optional of should return an Optional with the given value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/core/commons/optional.ts:8:43
         this.value = value;
     }
 
-    public static empty<T>(): Optional<T> {
-        return new Optional<T>(null);
-    }
+    public static empty<T>(): Optional<T> {}
 
     public static of<T>(value: T): Optional<T> {
killedBy: Optional empty should return an empty Optional
statusReason: TypeError: Cannot read properties of undefined (reading 'isPresent')

[Killed] BlockStatement
src/core/commons/optional.ts:12:48
         return new Optional<T>(null);
     }
 
-    public static of<T>(value: T): Optional<T> {
-        return new Optional(value);
-    }
+    public static of<T>(value: T): Optional<T> {}
 
     public get(): T {
killedBy: Optional of should throw an error if the given value is null
statusReason: TypeError: Cannot read properties of undefined (reading 'isPresent')

[Killed] BlockStatement
src/core/commons/optional.ts:16:21
         return new Optional(value);
     }
 
-    public get(): T {
-        if (!this.isPresent()) {
-            throw new Error('No value present');
-        }
-        return this.value;
-    }
+    public get(): T {}
 
     public static ofNullable<T>(value: T): Optional<T> {
killedBy: Optional empty should return an empty Optional
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No value present"

Received function did not throw

[Killed] BooleanLiteral
src/core/commons/optional.ts:17:13
     }
 
     public get(): T {
-        if (!this.isPresent()) {
+        if (this.isPresent()) {
             throw new Error('No value present');
         }
killedBy: Optional empty should return an empty Optional
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "No value present"

Received function did not throw

[Killed] ConditionalExpression
src/core/commons/optional.ts:17:13
     }
 
     public get(): T {
-        if (!this.isPresent()) {
+        if (true) {
             throw new Error('No value present');
         }
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: No value present

[Killed] BlockStatement
src/core/commons/optional.ts:23:56
         return this.value;
     }
 
-    public static ofNullable<T>(value: T): Optional<T> {
-        return value != null ? Optional.of(value) : Optional.empty();
-    }
+    public static ofNullable<T>(value: T): Optional<T> {}
 
     public isPresent(): boolean {
killedBy: GetUserByNameProvider, execute() should return an empty optional when user is not found
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/core/commons/optional.ts:24:16
     }
 
     public static ofNullable<T>(value: T): Optional<T> {
-        return value != null ? Optional.of(value) : Optional.empty();
+        return true ? Optional.of(value) : Optional.empty();
     }
 
killedBy: Optional ofNullable should return an empty Optional when value is undefined
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Optional {
-   "value": null,
+   "value": undefined,

[Killed] EqualityOperator
src/core/commons/optional.ts:24:16
     }
 
     public static ofNullable<T>(value: T): Optional<T> {
-        return value != null ? Optional.of(value) : Optional.empty();
+        return value == null ? Optional.of(value) : Optional.empty();
     }
 
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/core/commons/optional.ts:27:33
         return value != null ? Optional.of(value) : Optional.empty();
     }
 
-    public isPresent(): boolean {
-        return this.value != null;
-    }
+    public isPresent(): boolean {}
 
     public ifPresent(method: (value: T) => void): void {
killedBy: GetUserByNameUseCase execute() should return the user when the user is found
statusReason: NotFoundException: validation.user.name.not.found

[Killed] EqualityOperator
src/core/commons/optional.ts:28:16
     }
 
     public isPresent(): boolean {
-        return this.value != null;
+        return this.value == null;
     }
 
killedBy: GetUserByNameProvider, execute() should return an empty optional when user is not found
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/core/commons/optional.ts:28:16
     }
 
     public isPresent(): boolean {
-        return this.value != null;
+        return true;
     }
 
killedBy: GetUserByNameUseCase execute() should throw an error when the user is not found
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/core/commons/optional.ts:31:56
         return this.value != null;
     }
 
-    public ifPresent(method: (value: T) => void): void {
-        if (this.isPresent()) method(this.value);
-    }
+    public ifPresent(method: (value: T) => void): void {}
 
     public orElse(other: T): T {
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/core/commons/optional.ts:32:13
     }
 
     public ifPresent(method: (value: T) => void): void {
-        if (this.isPresent()) method(this.value);
+        if (false) method(this.value);
     }
 
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/core/commons/optional.ts:32:13
     }
 
     public ifPresent(method: (value: T) => void): void {
-        if (this.isPresent()) method(this.value);
+        if (true) method(this.value);
     }
 
killedBy: RegisterUserUseCase execute() should run successfully when username is not registered
statusReason: UniqueConstraintException: validation.user.name.duplicated

[Killed] BlockStatement
src/core/commons/optional.ts:35:32
         if (this.isPresent()) method(this.value);
     }
 
-    public orElse(other: T): T {
-        return this.isPresent() ? this.value : other;
-    }
+    public orElse(other: T): T {}
 
     public orElseGet(method: () => T): T {
killedBy: Optional orElse should return the value if present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo"
Received: undefined

[Killed] BlockStatement
src/core/commons/optional.ts:39:42
         return this.isPresent() ? this.value : other;
     }
 
-    public orElseGet(method: () => T): T {
-        return this.isPresent() ? this.value : method();
-    }
+    public orElseGet(method: () => T): T {}
 
     public orElseThrow<E extends Error>(error: () => E): T {
killedBy: Optional orElseGet should return the value if present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "foo"
Received: undefined

[Killed] BlockStatement
src/core/commons/optional.ts:43:60
         return this.isPresent() ? this.value : method();
     }
 
-    public orElseThrow<E extends Error>(error: () => E): T {
-        if (this.isPresent()) {
-            return this.value;
-        }
-        // eslint-disable-next-line @typescript-eslint/no-throw-literal
-        throw error();
-    }
+    public orElseThrow<E extends Error>(error: () => E): T {}
 
     public map<R>(mapper: (value: T) => R): Optional<R> {
killedBy: GetUserByNameUseCase execute() should throw an error when the user is not found
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/core/commons/optional.ts:44:31
     }
 
     public orElseThrow<E extends Error>(error: () => E): T {
-        if (this.isPresent()) {
-            return this.value;
-        }
+        if (this.isPresent()) {}
         // eslint-disable-next-line @typescript-eslint/no-throw-literal
         throw error();
killedBy: GetUserByNameUseCase execute() should return the user when the user is found
statusReason: NotFoundException: validation.user.name.not.found

[Killed] ConditionalExpression
src/core/commons/optional.ts:44:13
     }
 
     public orElseThrow<E extends Error>(error: () => E): T {
-        if (this.isPresent()) {
+        if (true) {
             return this.value;
         }
killedBy: GetUserByNameUseCase execute() should throw an error when the user is not found
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/core/commons/optional.ts:51:57
         throw error();
     }
 
-    public map<R>(mapper: (value: T) => R): Optional<R> {
-        if (!this.isPresent()) {
-            return Optional.empty();
-        }
-        return Optional.ofNullable(mapper(this.value));
-    }
+    public map<R>(mapper: (value: T) => R): Optional<R> {}
 }
 
killedBy: Optional map should return an Optional with the result of the given function
statusReason: TypeError: Cannot read properties of undefined (reading 'isPresent')

[Killed] ConditionalExpression
src/core/commons/optional.ts:52:13
     }
 
     public map<R>(mapper: (value: T) => R): Optional<R> {
-        if (!this.isPresent()) {
+        if (true) {
             return Optional.empty();
         }
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/core/commons/optional.ts:52:13
     }
 
     public map<R>(mapper: (value: T) => R): Optional<R> {
-        if (!this.isPresent()) {
+        if (this.isPresent()) {
             return Optional.empty();
         }
killedBy: GetUserByNameProvider, execute() should return an empty optional when user is not found
statusReason: TypeError: Cannot read properties of null (reading 'id')
