[Killed] BlockStatement
src/core/exceptions/core.exception.ts:4:58
 export class CoreException extends Error {
     public parameters: Array<any>;
 
-    constructor(message: string, parameters: Array<any>) {
-        super(message);
-        this.message = message;
-        this.parameters = parameters;
-    }
+    constructor(message: string, parameters: Array<any>) {}
 }
 
killedBy: POST /users should return 500 Internal Server Error when an unexpected error occurs
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
