[Killed] BlockStatement
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:8:19
 export class GetUserByNameQueryValidator extends Validator<GetUserByNameQuery> {
     private static instance: GetUserByNameQueryValidator;
 
-    constructor() {
-        super();
-
-        this.ruleFor('name')
-            .notNull()
-            .withMessage('validation.user.name.blank')
-            .notEmpty()
-            .withMessage('validation.user.name.blank');
-    }
+    constructor() {}
 
     public static getInstance(): GetUserByNameQueryValidator {
killedBy: GetUserByNameUseCase execute() should throw an error when the user is not found
statusReason: ReferenceError: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Survived] StringLiteral
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:15:26
             .notNull()
             .withMessage('validation.user.name.blank')
             .notEmpty()
-            .withMessage('validation.user.name.blank');
+            .withMessage("");
     }
 

[Killed] BlockStatement
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:18:62
             .withMessage('validation.user.name.blank');
     }
 
-    public static getInstance(): GetUserByNameQueryValidator {
-        if (!GetUserByNameQueryValidator.instance) {
-            GetUserByNameQueryValidator.instance = this.createInstance();
-        }
-        return GetUserByNameQueryValidator.instance;
-    }
+    public static getInstance(): GetUserByNameQueryValidator {}
 
     public static createInstance(): GetUserByNameQueryValidator {
killedBy: GET /users/by-name should return 400 BadRequest when query parameter is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:19:13
     }
 
     public static getInstance(): GetUserByNameQueryValidator {
-        if (!GetUserByNameQueryValidator.instance) {
+        if (false) {
             GetUserByNameQueryValidator.instance = this.createInstance();
         }
killedBy: GET /users/by-name should return 400 BadRequest when query parameter is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BooleanLiteral
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:19:13
     }
 
     public static getInstance(): GetUserByNameQueryValidator {
-        if (!GetUserByNameQueryValidator.instance) {
+        if (GetUserByNameQueryValidator.instance) {
             GetUserByNameQueryValidator.instance = this.createInstance();
         }
killedBy: GET /users/by-name should return 400 BadRequest when query parameter is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:25:65
         return GetUserByNameQueryValidator.instance;
     }
 
-    public static createInstance(): GetUserByNameQueryValidator {
-        return new GetUserByNameQueryValidator();
-    }
+    public static createInstance(): GetUserByNameQueryValidator {}
 
     public static ValidateAndThrow(command: GetUserByNameQuery): void {
killedBy: GetUserByNameUseCase execute() should throw an error when the user is not found
statusReason: TypeError: Cannot read properties of undefined (reading 'validate')

[Killed] BlockStatement
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:29:71
         return new GetUserByNameQueryValidator();
     }
 
-    public static ValidateAndThrow(command: GetUserByNameQuery): void {
-        const instance = GetUserByNameQueryValidator.getInstance();
-        const errors = instance.validate(command);
-        if ((Object.keys(errors).length === 0)) { return; }
-        throw new ValidationException('common.validation.alert', [command, errors]);
-    }
+    public static ValidateAndThrow(command: GetUserByNameQuery): void {}
 }
 
killedBy: GetUserByNameQuery, constructor() should throw an error when the query has empty parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:32:49
     public static ValidateAndThrow(command: GetUserByNameQuery): void {
         const instance = GetUserByNameQueryValidator.getInstance();
         const errors = instance.validate(command);
-        if ((Object.keys(errors).length === 0)) { return; }
+        if ((Object.keys(errors).length === 0)) {}
         throw new ValidationException('common.validation.alert', [command, errors]);
     }
killedBy: GetUserByNameQuery, constructor() should create query object when the parameters are filled correcly
statusReason: ValidationException: common.validation.alert

[Killed] ConditionalExpression
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:32:14
     public static ValidateAndThrow(command: GetUserByNameQuery): void {
         const instance = GetUserByNameQueryValidator.getInstance();
         const errors = instance.validate(command);
-        if ((Object.keys(errors).length === 0)) { return; }
+        if ((false)) { return; }
         throw new ValidationException('common.validation.alert', [command, errors]);
     }
killedBy: GetUserByNameQuery, constructor() should create query object when the parameters are filled correcly
statusReason: ValidationException: common.validation.alert

[Killed] ArrayDeclaration
core/usecases/get-user-by-name/get-user-by-name-query.validator.ts:33:66
         const instance = GetUserByNameQueryValidator.getInstance();
         const errors = instance.validate(command);
         if ((Object.keys(errors).length === 0)) { return; }
-        throw new ValidationException('common.validation.alert', [command, errors]);
+        throw new ValidationException('common.validation.alert', []);
     }
 }
killedBy: GET /users/by-name should return 400 BadRequest when query parameter is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500
