[Killed] BlockStatement
src/core/exceptions/not-found.exception.ts:4:53
 import { CoreException } from '@/core/exceptions';
 
 export class NotFoundException extends CoreException {
-    constructor(message: string, parameters: any[]) {
-        super(message, parameters);
-        this.name = NotFoundException.name;
-    }
+    constructor(message: string, parameters: any[]) {}
 }
 
killedBy: GetUserByNameUseCase execute() should throw an error when the user is not found
statusReason: Error: expect(received).not.toBeNull()

Received: null
