[Killed] BlockStatement
src/core/exceptions/unique-constraint.exception.ts:4:53
 import { CoreException } from '@/core/exceptions';
 
 export class UniqueConstraintException extends CoreException {
-    constructor(message: string, parameters: any[]) {
-        super(message, parameters);
-        this.name = UniqueConstraintException.name;
-    }
+    constructor(message: string, parameters: any[]) {}
 }
 
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: Error: expect(received).not.toBeNull()

Received: null
