[Killed] BlockStatement
src/core/exceptions/validation.exception.ts:4:53
 import { CoreException } from '@/core/exceptions';
 
 export class ValidationException extends CoreException {
-    constructor(message: string, parameters: any[]) {
-        super(message, parameters);
-        this.name = ValidationException.name;
-    }
+    constructor(message: string, parameters: any[]) {}
 }
 
killedBy: POST /users should return 400 BadRequest when request parameter is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500
