[Killed] BlockStatement
core/usecases/get-user-by-name/get-user-by-name.usecase.ts:10:61
 @Injectable()
 export class GetUserByNameUseCase implements IGetUserByNameUseCase {
     constructor(@Inject(IGetUserByNameGatewaySymbol) private gateway: IGetUserByNameGateway) { }
-    async execute(query: GetUserByNameQuery): Promise<User> {
-        const optional = await this.gateway.execute(query.name);
-        return optional.orElseThrow(() => new NotFoundException('validation.user.name.not.found', [query.name]));
-    }
+    async execute(query: GetUserByNameQuery): Promise<User> {}
 }
 
killedBy: GetUserByNameUseCase execute() should throw an error when the user is not found
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ArrowFunction
core/usecases/get-user-by-name/get-user-by-name.usecase.ts:12:37
     constructor(@Inject(IGetUserByNameGatewaySymbol) private gateway: IGetUserByNameGateway) { }
     async execute(query: GetUserByNameQuery): Promise<User> {
         const optional = await this.gateway.execute(query.name);
-        return optional.orElseThrow(() => new NotFoundException('validation.user.name.not.found', [query.name]));
+        return optional.orElseThrow(() => undefined);
     }
 }
killedBy: GetUserByNameUseCase execute() should throw an error when the user is not found
statusReason: Error: expect(received).not.toBeNull()

Received: null
