[Killed] BlockStatement
core/usecases/get-user-by-name/get-user-by-name.query.ts:6:31
 export class GetUserByNameQuery {
     name: string;
 
-    constructor(name: string) {
-        this.name = name;
-        GetUserByNameQueryValidator.ValidateAndThrow(this);
-    }
+    constructor(name: string) {}
 }
 
killedBy: GET /users/by-name should return 400 BadRequest when query parameter is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500
