[Killed] BlockStatement
core/usecases/register-user/register-user.command.ts:10:82
     password: string;
     fullname: string;
 
-    constructor(name: string, email: string, password: string, fullname: string) {
-        this.name = name;
-        this.email = email;
-        this.password = password;
-        this.fullname = fullname;
-        RegisterUserCommandValidator.ValidateAndThrow(this);
-    }
+    constructor(name: string, email: string, password: string, fullname: string) {}
 }
 
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: Error: expect(received).not.toBeNull()

Received: null
