[Killed] StringLiteral
core/usecases/register-user/register-user.command.validator.ts:12:22
     constructor() {
         super();
 
-        this.ruleFor('name')
+        this.ruleFor("")
             .notNull()
             .withMessage('validation.user.name.blank')
killedBy: POST /users should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Killed] StringLiteral
core/usecases/register-user/register-user.command.validator.ts:26:22
             .emailAddress()
             .withMessage('validation.user.email.invalid');
 
-        this.ruleFor('password')
+        this.ruleFor("")
             .notNull()
             .withMessage('validation.user.password.blank')
killedBy: POST /users should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 400

[Killed] BlockStatement
core/usecases/register-user/register-user.command.validator.ts:39:64
             .withMessage('validation.user.fullname.blank');
     }
 
-    private static getInstance(): RegisterUserCommandValidator {
-        if (!RegisterUserCommandValidator.instance) {
-            RegisterUserCommandValidator.instance = this.createInstance();
-        }
-        return RegisterUserCommandValidator.instance;
-    }
+    private static getInstance(): RegisterUserCommandValidator {}
 
     private static createInstance(): RegisterUserCommandValidator {
killedBy: POST /users should return 400 BadRequest when request parameter is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
core/usecases/register-user/register-user.command.validator.ts:40:13
     }
 
     private static getInstance(): RegisterUserCommandValidator {
-        if (!RegisterUserCommandValidator.instance) {
+        if (false) {
             RegisterUserCommandValidator.instance = this.createInstance();
         }
killedBy: POST /users should return 400 BadRequest when request parameter is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BooleanLiteral
core/usecases/register-user/register-user.command.validator.ts:40:13
     }
 
     private static getInstance(): RegisterUserCommandValidator {
-        if (!RegisterUserCommandValidator.instance) {
+        if (RegisterUserCommandValidator.instance) {
             RegisterUserCommandValidator.instance = this.createInstance();
         }
killedBy: RegisterUserCommand, constructor() should throw an error when the command has null parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
core/usecases/register-user/register-user.command.validator.ts:46:67
         return RegisterUserCommandValidator.instance;
     }
 
-    private static createInstance(): RegisterUserCommandValidator {
-        return new RegisterUserCommandValidator();
-    }
+    private static createInstance(): RegisterUserCommandValidator {}
 
     public static ValidateAndThrow(command: RegisterUserCommand): void {
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: TypeError: Cannot read properties of undefined (reading 'validate')

[Killed] BlockStatement
core/usecases/register-user/register-user.command.validator.ts:50:72
         return new RegisterUserCommandValidator();
     }
 
-    public static ValidateAndThrow(command: RegisterUserCommand): void {
-        const instance = RegisterUserCommandValidator.getInstance();
-        const errors = instance.validate(command);
-        if ((Object.keys(errors).length === 0)) { return; }
-        throw new ValidationException('common.validation.alert', [command, errors]);
-    }
+    public static ValidateAndThrow(command: RegisterUserCommand): void {}
 }
 
killedBy: POST /users should return 400 BadRequest when request parameter is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ConditionalExpression
core/usecases/register-user/register-user.command.validator.ts:53:14
     public static ValidateAndThrow(command: RegisterUserCommand): void {
         const instance = RegisterUserCommandValidator.getInstance();
         const errors = instance.validate(command);
-        if ((Object.keys(errors).length === 0)) { return; }
+        if ((true)) { return; }
         throw new ValidationException('common.validation.alert', [command, errors]);
     }
killedBy: POST /users should return 400 BadRequest when request parameter is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] EqualityOperator
core/usecases/register-user/register-user.command.validator.ts:53:14
     public static ValidateAndThrow(command: RegisterUserCommand): void {
         const instance = RegisterUserCommandValidator.getInstance();
         const errors = instance.validate(command);
-        if ((Object.keys(errors).length === 0)) { return; }
+        if ((Object.keys(errors).length !== 0)) { return; }
         throw new ValidationException('common.validation.alert', [command, errors]);
     }
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: ValidationException: common.validation.alert
