[Killed] BlockStatement
core/usecases/register-user/register-user.usecase.ts:18:64
         @Inject(IRegisterUserGatewaySymbol)
         private registerUserGateway: IRegisterUserGateway,
     ) { }
-    async execute(command: RegisterUserCommand): Promise<User> {
-        await this.checkDuplicatedName(command.name);
-
-        const user: User = {
-            id: null,
-            name: command.name,
-            email: command.email,
-            password: command.password,
-            fullname: command.fullname,
-            createdAt: this.getDateTimeService.now(),
-        };
-
-        return this.registerUserGateway.execute(user);
-    }
+    async execute(command: RegisterUserCommand): Promise<User> {}
 
     async checkDuplicatedName(name: string): Promise<void> {
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
core/usecases/register-user/register-user.usecase.ts:33:60
         return this.registerUserGateway.execute(user);
     }
 
-    async checkDuplicatedName(name: string): Promise<void> {
-        const optional = await this.getUserByNameGateway.execute(name);
-        optional.ifPresent(() => this.throwUniqueConstraintException(name));
-    }
+    async checkDuplicatedName(name: string): Promise<void> {}
 
     throwUniqueConstraintException(name: string): void {
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ArrowFunction
core/usecases/register-user/register-user.usecase.ts:35:28
 
     async checkDuplicatedName(name: string): Promise<void> {
         const optional = await this.getUserByNameGateway.execute(name);
-        optional.ifPresent(() => this.throwUniqueConstraintException(name));
+        optional.ifPresent(() => undefined);
     }
 
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
core/usecases/register-user/register-user.usecase.ts:38:56
         optional.ifPresent(() => this.throwUniqueConstraintException(name));
     }
 
-    throwUniqueConstraintException(name: string): void {
-        throw new UniqueConstraintException('validation.user.name.duplicated', [name]);
-    }
+    throwUniqueConstraintException(name: string): void {}
 }
 
killedBy: RegisterUserUseCase execute() should throw error when username is already registered
statusReason: Error: expect(received).not.toBeNull()

Received: null
