[Killed] BlockStatement
src/infra/mappers/user.mapper.ts:5:56
 import { UserEntity } from '@/infra/models';
 
 export class UserMapper {
-    public static toUserEntity(user: User): UserEntity {
-        return new UserEntity(
-            user.id,
-            user.name,
-            user.email,
-            user.password,
-            user.fullname,
-            user.createdAt,
-        );
-    }
+    public static toUserEntity(user: User): UserEntity {}
 
     public static toUser(userEntity: UserEntity): User {
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/infra/mappers/user.mapper.ts:16:56
         );
     }
 
-    public static toUser(userEntity: UserEntity): User {
-        return new User(
-            userEntity.id,
-            userEntity.name,
-            userEntity.email,
-            userEntity.password,
-            userEntity.fullname,
-            userEntity.createdAt,
-        );
-    }
+    public static toUser(userEntity: UserEntity): User {}
 }
 
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false
