[Killed] BlockStatement
src/infra/models/user-entity.model.ts:16:7
         password: string,
         fullname: string,
         createdAt: Date,
-    ) {
-        this.id = id;
-        this.name = name;
-        this.email = email;
-        this.password = password;
-        this.fullname = fullname;
-        this.createdAt = createdAt;
-    }
+    ) {}
 }
 
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false
