[Killed] BlockStatement
src/infra/providers/get-user-by-name.provider.ts:12:58
 export class GetUserByNameProvider implements IGetUserByNameGateway {
     constructor(private userRepository: UserRepository) { }
 
-    async execute(name: string): Promise<Optional<User>> {
-        const optional = await this.userRepository.findByName(name);
-        return optional.map((entity) => UserMapper.toUser(entity));
-    }
+    async execute(name: string): Promise<Optional<User>> {}
 }
 
killedBy: GetUserByNameProvider, execute() should return an empty optional when user is not found
statusReason: TypeError: Cannot read properties of undefined (reading 'isPresent')

[Killed] ArrowFunction
src/infra/providers/get-user-by-name.provider.ts:14:29
 
     async execute(name: string): Promise<Optional<User>> {
         const optional = await this.userRepository.findByName(name);
-        return optional.map((entity) => UserMapper.toUser(entity));
+        return optional.map(() => undefined);
     }
 }
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false
