[Killed] BlockStatement
src/infra/providers/register-user.provider.ts:12:46
 export class RegisterUserProvider implements IRegisterUserGateway {
     constructor(private userRepository: UserRepository) { }
 
-    async execute(user: User): Promise<User> {
-        const entity: UserEntity = UserMapper.toUserEntity(user);
-        return UserMapper.toUser(await this.userRepository.save(entity));
-    }
+    async execute(user: User): Promise<User> {}
 }
 
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false
