[Killed] BlockStatement
src/infra/repositories/user.repository.ts:7:44
 export class UserRepository {
     public static users: Array<User> = [];
 
-    public save(user: User): Promise<User> {
-        const nextId = UserRepository.users.length + 1;
-        const userWithId = { ...user, id: nextId } as User;
-        UserRepository.users.push(userWithId);
-        return Promise.resolve(userWithId);
-    }
+    public save(user: User): Promise<User> {}
 
     public findByName(name: string): Promise<Optional<User>> {
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ArithmeticOperator
src/infra/repositories/user.repository.ts:8:24
     public static users: Array<User> = [];
 
     public save(user: User): Promise<User> {
-        const nextId = UserRepository.users.length + 1;
+        const nextId = UserRepository.users.length - 1;
         const userWithId = { ...user, id: nextId } as User;
         UserRepository.users.push(userWithId);
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/infra/repositories/user.repository.ts:14:62
         return Promise.resolve(userWithId);
     }
 
-    public findByName(name: string): Promise<Optional<User>> {
-        const user = UserRepository.users.find((element) => element.name === name);
-        const optional = Optional.ofNullable(user);
-        return Promise.resolve(optional);
-    }
+    public findByName(name: string): Promise<Optional<User>> {}
 }
 
killedBy: GetUserByNameProvider, execute() should return an empty optional when user is not found
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/infra/repositories/user.repository.ts:15:48
     }
 
     public findByName(name: string): Promise<Optional<User>> {
-        const user = UserRepository.users.find((element) => element.name === name);
+        const user = UserRepository.users.find(() => undefined);
         const optional = Optional.ofNullable(user);
         return Promise.resolve(optional);
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/infra/repositories/user.repository.ts:15:61
     }
 
     public findByName(name: string): Promise<Optional<User>> {
-        const user = UserRepository.users.find((element) => element.name === name);
+        const user = UserRepository.users.find((element) => element.name !== name);
         const optional = Optional.ofNullable(user);
         return Promise.resolve(optional);
killedBy: GetUserByNameProvider, execute() should return user entity when provider is invoked
statusReason: Error: expect(received).toBeTruthy()

Received: false
