[Killed] BlockStatement
web-api/commons/filters/global-exception.filter.ts:12:102
     private readonly httpAdapter: AbstractHttpAdapter;
     private readonly i18nService: II18nService;
 
-    constructor(adapterHost: HttpAdapterHost, @Inject(II18nServiceSymbol) i18nService: II18nService) {
-        this.httpAdapter = adapterHost.httpAdapter;
-        this.i18nService = i18nService;
-    }
+    constructor(adapterHost: HttpAdapterHost, @Inject(II18nServiceSymbol) i18nService: II18nService) {}
 
     catch(exception: Error, host: ArgumentsHost) {
killedBy: POST /users should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

  Object {
-   "code": 500,
-   "fields": Array [],

[Timeout] BlockStatement
web-api/commons/filters/global-exception.filter.ts:17:50
         this.i18nService = i18nService;
     }
 
-    catch(exception: Error, host: ArgumentsHost) {
-        const context = host.switchToHttp();
-        const response = context.getResponse<Response>();
-        const status: number = HttpStatus.INTERNAL_SERVER_ERROR;
-        const key = 'messages.common.unexpected.exception';
-        const message: string = this.i18nService.translate(key);
-        const body: ResponseStatus = new ResponseStatus(status, message, []);
-        this.logger.debug(`Language: ${this.i18nService.lang()}`);
-        this.logger.debug(exception.message);
-        this.logger.debug(exception.stack);
-        this.logger.error(JSON.stringify(body));
-        this.httpAdapter.reply(response, body, status);
-    }
+    catch(exception: Error, host: ArgumentsHost) {}
 }
 
