[Killed] ArrayDeclaration
web-api/commons/filters/unique-constraint.filter.ts:25:74
         const key = `messages.${exception.message}`;
         const message: string = this.i18nService.format(key, exception.parameters);
         const status: number = HttpStatus.BAD_REQUEST;
-        const body: ResponseStatus = new ResponseStatus(status, message, []);
+        const body: ResponseStatus = new ResponseStatus(status, message, ["Stryker was here"]);
         this.logger.warn(JSON.stringify(body));
         this.httpAdapter.reply(response, body, status);
killedBy: POST /users should return 400 BadRequest when user is already registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "code": 400,
-   "fields": Array [],
