[Timeout] BlockStatement
web-api/commons/filters/validation-exception.filter.ts:19:64
         this.i18nService = i18nService;
     }
 
-    catch(exception: ValidationException, host: ArgumentsHost) {
-        const context: HttpArgumentsHost = host.switchToHttp();
-        const command: object = exception.parameters[0] as object;
-        const errors: object = exception.parameters[1] as object;
-        const fields: Array<Field> = new Array<Field>();
-        Object.keys(errors).forEach((error) => {
-            const key = `messages.${errors[error] as string}`;
-            const message: string = this.i18nService.translate(key);
-            const value: string = command[error] as string;
-            const field: Field = new Field(error, message, value);
-            fields.push(field);
-        });
-        const status: number = HttpStatus.BAD_REQUEST;
-        const key = `messages.${exception.message}`;
-        const message: string = this.i18nService.translate(key);
-        const body: ResponseStatus = new ResponseStatus(status, message, fields);
-        this.logger.warn(JSON.stringify(body));
-        this.httpAdapter.reply(context.getResponse(), body, status);
-    }
+    catch(exception: ValidationException, host: ArgumentsHost) {}
 }
 

[Killed] BlockStatement
web-api/commons/filters/validation-exception.filter.ts:24:48
         const command: object = exception.parameters[0] as object;
         const errors: object = exception.parameters[1] as object;
         const fields: Array<Field> = new Array<Field>();
-        Object.keys(errors).forEach((error) => {
-            const key = `messages.${errors[error] as string}`;
-            const message: string = this.i18nService.translate(key);
-            const value: string = command[error] as string;
-            const field: Field = new Field(error, message, value);
-            fields.push(field);
-        });
+        Object.keys(errors).forEach((error) => {});
         const status: number = HttpStatus.BAD_REQUEST;
         const key = `messages.${exception.message}`;
killedBy: GET /users/by-name should return 400 BadRequest when query parameter is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Object {
    "code": 400,
-   "fields": Array [
