[Killed] BlockStatement
web-api/commons/interceptors/response-transformer.interceptor.ts:11:47
 export class ResponseTransformerInterceptor implements NestInterceptor {
     private httpAdapter: AbstractHttpAdapter;
 
-    constructor(adapterHost: HttpAdapterHost) {
-        this.httpAdapter = adapterHost.httpAdapter;
-    }
+    constructor(adapterHost: HttpAdapterHost) {}
 
     intercept(context: ExecutionContext, next: CallHandler<any>): Observable<any> | Promise<Observable<any>> {
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
web-api/commons/interceptors/response-transformer.interceptor.ts:15:110
         this.httpAdapter = adapterHost.httpAdapter;
     }
 
-    intercept(context: ExecutionContext, next: CallHandler<any>): Observable<any> | Promise<Observable<any>> {
-        return next.handle()
-            .pipe(
-                map((httpResponse: HttpResponse) => {
-                    if (httpResponse instanceof HttpResponse) {
-                        return this.transform(context, httpResponse);
-                    }
-                    return httpResponse;
-                }),
-            );
-    }
+    intercept(context: ExecutionContext, next: CallHandler<any>): Observable<any> | Promise<Observable<any>> {}
 
     private transform(context: ExecutionContext, httpResponse: HttpResponse) {
killedBy: POST /users should return 400 BadRequest when request parameter is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] BlockStatement
web-api/commons/interceptors/response-transformer.interceptor.ts:18:53
     intercept(context: ExecutionContext, next: CallHandler<any>): Observable<any> | Promise<Observable<any>> {
         return next.handle()
             .pipe(
-                map((httpResponse: HttpResponse) => {
-                    if (httpResponse instanceof HttpResponse) {
-                        return this.transform(context, httpResponse);
-                    }
-                    return httpResponse;
-                }),
+                map((httpResponse: HttpResponse) => {}),
             );
     }
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "location"
Received path: []

Expected value: "/users/by-name?name=jszero"
Received value: {"cache-control": "no-cache", "connection": "close", "content-length": "0", "content-type": "application/json; charset=utf-8", "date": "Tue, 27 Jun 2023 01:42:38 GMT", "x-powered-by": "Express"}

[Killed] BlockStatement
web-api/commons/interceptors/response-transformer.interceptor.ts:19:63
         return next.handle()
             .pipe(
                 map((httpResponse: HttpResponse) => {
-                    if (httpResponse instanceof HttpResponse) {
-                        return this.transform(context, httpResponse);
-                    }
+                    if (httpResponse instanceof HttpResponse) {}
                     return httpResponse;
                 }),
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "location"
Received path: []

Expected value: "/users/by-name?name=jszero"
Received value: {"cache-control": "no-cache", "connection": "close", "content-length": "217", "content-type": "application/json; charset=utf-8", "date": "Tue, 27 Jun 2023 01:42:43 GMT", "etag": "W/\"d9-ZI+PuT7vNAHzEOAuIL8vhqtEZSM\"", "x-powered-by": "Expres

[Killed] ConditionalExpression
web-api/commons/interceptors/response-transformer.interceptor.ts:19:25
         return next.handle()
             .pipe(
                 map((httpResponse: HttpResponse) => {
-                    if (httpResponse instanceof HttpResponse) {
+                    if (true) {
                         return this.transform(context, httpResponse);
                     }
killedBy: GET /users/by-name should return 200 Success when user is registered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 500

[Killed] BlockStatement
web-api/commons/interceptors/response-transformer.interceptor.ts:27:78
             );
     }
 
-    private transform(context: ExecutionContext, httpResponse: HttpResponse) {
-        const httpContext = context.switchToHttp();
-        const response = httpContext.getResponse<Response>();
-        const { status, headers, body } = httpResponse;
-        const headersKeys = Object.getOwnPropertyNames(headers);
-        headersKeys.forEach((headerKey) => {
-            const headerValue = headers[headerKey] as string;
-            this.httpAdapter.setHeader(response, headerKey, headerValue);
-        });
-        this.httpAdapter.status(response, status);
-        return body;
-    }
+    private transform(context: ExecutionContext, httpResponse: HttpResponse) {}
 }
 
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "location"
Received path: []

Expected value: "/users/by-name?name=jszero"
Received value: {"cache-control": "no-cache", "connection": "close", "content-length": "0", "content-type": "application/json; charset=utf-8", "date": "Tue, 27 Jun 2023 01:42:45 GMT", "x-powered-by": "Express"}

[Killed] BlockStatement
web-api/commons/interceptors/response-transformer.interceptor.ts:32:44
         const response = httpContext.getResponse<Response>();
         const { status, headers, body } = httpResponse;
         const headersKeys = Object.getOwnPropertyNames(headers);
-        headersKeys.forEach((headerKey) => {
-            const headerValue = headers[headerKey] as string;
-            this.httpAdapter.setHeader(response, headerKey, headerValue);
-        });
+        headersKeys.forEach((headerKey) => {});
         this.httpAdapter.status(response, status);
         return body;
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "location"
Received path: []

Expected value: "/users/by-name?name=jszero"
Received value: {"cache-control": "no-cache", "connection": "close", "content-length": "143", "content-type": "application/json; charset=utf-8", "date": "Tue, 27 Jun 2023 01:42:47 GMT", "etag": "W/\"8f-xLGcx1F/XqNLAGIzNRtITTjghFc\"", "x-powered-by": "Expres
