[Killed] BlockStatement
web-api/commons/interceptors/stopwatch.interceptor.ts:9:78
 export class StopwatchInterceptor implements NestInterceptor {
     private readonly logger = new Logger(StopwatchInterceptor.name);
 
-    intercept(context: ExecutionContext, next: CallHandler): Observable<any> {
-        const now = Date.now();
-        return next.handle().pipe(tap(this.log(context, now)));
-    }
+    intercept(context: ExecutionContext, next: CallHandler): Observable<any> {}
 
     private log(context: ExecutionContext, now: number): (value: any) => void {
killedBy: POST /users should return 400 BadRequest when request parameter is invalid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Survived] BlockStatement
web-api/commons/interceptors/stopwatch.interceptor.ts:14:79
         return next.handle().pipe(tap(this.log(context, now)));
     }
 
-    private log(context: ExecutionContext, now: number): (value: any) => void {
-        return () => {
-            this.logger.log(`${context.getClass().name} executed in ${Date.now() - now} ms.`);
-        };
-    }
+    private log(context: ExecutionContext, now: number): (value: any) => void {}
 }
 

[Survived] BlockStatement
web-api/commons/interceptors/stopwatch.interceptor.ts:15:22
     }
 
     private log(context: ExecutionContext, now: number): (value: any) => void {
-        return () => {
-            this.logger.log(`${context.getClass().name} executed in ${Date.now() - now} ms.`);
-        };
+        return () => {};
     }
 }

[Survived] ArithmeticOperator
web-api/commons/interceptors/stopwatch.interceptor.ts:16:71
 
     private log(context: ExecutionContext, now: number): (value: any) => void {
         return () => {
-            this.logger.log(`${context.getClass().name} executed in ${Date.now() - now} ms.`);
+            this.logger.log(`${context.getClass().name} executed in ${Date.now() + now} ms.`);
         };
     }
