[Killed] BlockStatement
web-api/commons/models/field.model.ts:23:7
         name: string,
         message: string,
         value: string,
-    ) {
-        this.name = name;
-        this.message = message;
-        this.value = value;
-    }
+    ) {}
 }
 
killedBy: GET /users/by-name should return 400 BadRequest when query parameter is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

  Object {
    "code": 400,
    "fields": Array [
