[Killed] BlockStatement
web-api/commons/models/http-response.builder.ts:10:60
         body: {},
     };
 
-    public withStatus(status: number): HttpResponseBuilder {
-        this.httpResponse.status = status;
-        return this;
-    }
+    public withStatus(status: number): HttpResponseBuilder {}
 
     public withHeaders(headers: object): HttpResponseBuilder {
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
web-api/commons/models/http-response.builder.ts:15:62
         return this;
     }
 
-    public withHeaders(headers: object): HttpResponseBuilder {
-        this.httpResponse.headers = headers;
-        return this;
-    }
+    public withHeaders(headers: object): HttpResponseBuilder {}
 
     public withBody(body: object): HttpResponseBuilder {
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
web-api/commons/models/http-response.builder.ts:20:56
         return this;
     }
 
-    public withBody(body: object): HttpResponseBuilder {
-        this.httpResponse.body = body;
-        return this;
-    }
+    public withBody(body: object): HttpResponseBuilder {}
 
     public build(): HttpResponse {
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
web-api/commons/models/http-response.builder.ts:25:34
         return this;
     }
 
-    public build(): HttpResponse {
-        return new HttpResponse(this.httpResponse);
-    }
+    public build(): HttpResponse {}
 }
 
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "location"
Received path: []

Expected value: "/users/by-name?name=jszero"
Received value: {"cache-control": "no-cache", "connection": "close", "content-length": "0", "content-type": "application/json; charset=utf-8", "date": "Tue, 27 Jun 2023 01:43:04 GMT", "x-powered-by": "Express"}
