[Killed] BlockStatement
web-api/commons/models/http-response.model.ts:6:45
     headers: object;
     body: object;
 
-    constructor(httpResponse: HttpResponse) {
-        Object.assign(this, httpResponse);
-    }
+    constructor(httpResponse: HttpResponse) {}
 }
 
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500
