[Killed] BlockStatement
web-api/commons/models/response-status.model.ts:31:7
         code: number,
         message: string,
         value: Array<Field>,
-    ) {
-        this.code = code;
-        this.message = message;
-        this.fields = value;
-    }
+    ) {}
 }
 
killedBy: GET /users/by-name should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "code": 500,
-   "fields": Array [],
