[Survived] BlockStatement
web-api/commons/services/I18n.service.ts:7:20
 
 @Injectable()
 export class I18nService implements II18nService {
-    lang(): string {
-        return I18nContext.current().lang;
-    }
+    lang(): string {}
 
     translate(key: string): string {

[Killed] BlockStatement
web-api/commons/services/I18n.service.ts:11:36
         return I18nContext.current().lang;
     }
 
-    translate(key: string): string {
-        return I18nContext.current().translate(key);
-    }
+    translate(key: string): string {}
 
     format(key: string, parameters: any[]): string {
killedBy: POST /users should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "code": 500,
    "fields": Array [],

[Killed] BlockStatement
web-api/commons/services/I18n.service.ts:15:52
         return I18nContext.current().translate(key);
     }
 
-    format(key: string, parameters: any[]): string {
-        let message: string = I18nContext.current().translate(key);
-        parameters.forEach((element: string, index: number) => {
-            message = message.replace(`{${index}}`, element);
-        });
-        return message;
-    }
+    format(key: string, parameters: any[]): string {}
 }
 
killedBy: POST /users should return 400 BadRequest when user is already registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "code": 400,
    "fields": Array [],

[Killed] BlockStatement
web-api/commons/services/I18n.service.ts:17:64
 
     format(key: string, parameters: any[]): string {
         let message: string = I18nContext.current().translate(key);
-        parameters.forEach((element: string, index: number) => {
-            message = message.replace(`{${index}}`, element);
-        });
+        parameters.forEach((element: string, index: number) => {});
         return message;
     }
killedBy: POST /users should return 400 BadRequest when user is already registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "code": 400,
    "fields": Array [],

[Killed] StringLiteral
web-api/commons/services/I18n.service.ts:18:39
     format(key: string, parameters: any[]): string {
         let message: string = I18nContext.current().translate(key);
         parameters.forEach((element: string, index: number) => {
-            message = message.replace(`{${index}}`, element);
+            message = message.replace(``, element);
         });
         return message;
killedBy: POST /users should return 400 BadRequest when user is already registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "code": 400,
    "fields": Array [],
