[Killed] BlockStatement
web-api/entrypoints/get-user-by-name/get-user-by-name.controller.decorator.ts:50:71
     @Header('Content-Type', 'application/json')
     @Header('Cache-Control', 'no-cache')
     @Get()
-    async execute(@Query('name') name: string): Promise<UserResponse> {
-        return this.getUserByNameController.execute(name);
-    }
+    async execute(@Query('name') name: string): Promise<UserResponse> {}
 }
 
killedBy: GET /users/by-name should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200
