[Killed] BlockStatement
web-api/entrypoints/get-user-by-name/get-user-by-name.controller.ts:10:56
 export class GetUserByNameController implements IGetUserByNameController {
     constructor(@Inject(IGetUserByNameUseCaseSymbol) private getUserByNameUseCase: IGetUserByNameUseCase) { }
 
-    async execute(name: string): Promise<UserResponse> {
-        const query: GetUserByNameQuery = new GetUserByNameQuery(name);
-        const user: User = await this.getUserByNameUseCase.execute(query);
-        return UserPresenter.of(user);
-    }
+    async execute(name: string): Promise<UserResponse> {}
 }
 
killedBy: GET /users/by-name should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 200
