[Killed] BlockStatement
web-api/entrypoints/health-check/health-check.service.ts:5:23
 
 @Injectable()
 export class HealthCheckService {
-    getLive(): object {
-        return { status: 'UP' };
-    }
+    getLive(): object {}
 
     getReady(): object {
killedBy: AppController GET /health-check/live should return status 200 OK with "UP" in the response body.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "UP",
- }

[Killed] ObjectLiteral
web-api/entrypoints/health-check/health-check.service.ts:6:16
 @Injectable()
 export class HealthCheckService {
     getLive(): object {
-        return { status: 'UP' };
+        return {};
     }
 
killedBy: AppController GET /health-check/live should return status 200 OK with "UP" in the response body.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "UP",
- }

[Killed] BlockStatement
web-api/entrypoints/health-check/health-check.service.ts:9:24
         return { status: 'UP' };
     }
 
-    getReady(): object {
-        return { status: 'UP' };
-    }
+    getReady(): object {}
 }
 
killedBy: AppController GET /health-check/ready should return status 200 OK with "UP" in the response body.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "UP",
- }
