[Killed] BlockStatement
web-api/entrypoints/health-check/health-check.controller.ts:11:30
 
     @ApiExcludeEndpoint()
     @Get('/health-check/live')
-    getHealthCheck(): object {
-        return this.service.getLive();
-    }
+    getHealthCheck(): object {}
 
     @ApiExcludeEndpoint()
killedBy: AppController GET /health-check/live should return status 200 OK with "UP" in the response body.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "UP",
- }

[Killed] BlockStatement
web-api/entrypoints/health-check/health-check.controller.ts:17:29
 
     @ApiExcludeEndpoint()
     @Get('/health-check/ready')
-    getReadyCheck(): object {
-        return this.service.getReady();
-    }
+    getReadyCheck(): object {}
 }
 
killedBy: AppController GET /health-check/ready should return status 200 OK with "UP" in the response body.
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "status": "UP",
- }
