[Killed] BlockStatement
web-api/entrypoints/register-user/register-user.controller.ts:12:72
 export class RegisterUserController implements IRegisterUserController {
     constructor(@Inject(IRegisterUserUseCaseSymbol) private registerUserUseCase: IRegisterUserUseCase) { }
 
-    async execute(request: RegisterUserRequest): Promise<HttpResponse> {
-        const command: RegisterUserCommand = new RegisterUserCommand(
-            request.name,
-            request.email,
-            request.password,
-            request.fullname,
-        );
-
-        const user: User = await this.registerUserUseCase.execute(command);
-        const userResponse = UserPresenter.of(user);
-
-        return new HttpResponseBuilder()
-            .withStatus(HttpStatus.CREATED)
-            .withHeaders({ Location: `/users/by-name?name=${user.name}` })
-            .withBody(userResponse)
-            .build();
-    }
+    async execute(request: RegisterUserRequest): Promise<HttpResponse> {}
 }
 
killedBy: POST /users should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 201

[Killed] ObjectLiteral
web-api/entrypoints/register-user/register-user.controller.ts:25:26
 
         return new HttpResponseBuilder()
             .withStatus(HttpStatus.CREATED)
-            .withHeaders({ Location: `/users/by-name?name=${user.name}` })
+            .withHeaders({})
             .withBody(userResponse)
             .build();
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "location"
Received path: []

Expected value: "/users/by-name?name=jszero"
Received value: {"cache-control": "no-cache", "connection": "close", "content-length": "143", "content-type": "application/json; charset=utf-8", "date": "Tue, 27 Jun 2023 01:43:24 GMT", "etag": "W/\"8f-xLGcx1F/XqNLAGIzNRtITTjghFc\"", "x-powered-by": "Expres
