[Killed] BlockStatement
web-api/entrypoints/register-user/register-user.decorator.controller.ts:50:80
     @Header('Content-Type', 'application/json')
     @Header('Cache-Control', 'no-cache')
     @Post()
-    async execute(@Body() request: RegisterUserRequest): Promise<HttpResponse> {
-        return this.registerUserController.execute(request);
-    }
+    async execute(@Body() request: RegisterUserRequest): Promise<HttpResponse> {}
 }
 
killedBy: POST /users should return 500 Internal Server Error when an unexpected error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 500
Received: 201
