[Killed] BlockStatement
src/web-api/xcutting/user-response.model.ts:37:37
     })
     createdAt: string;
 
-    constructor(user: UserResponse) {
-        Object.assign(this, user);
-    }
+    constructor(user: UserResponse) {}
 }
 
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "createdAt": "2022-12-27 00:00:00",
-   "email": "john.smith.zero@xyz.com",
