[Killed] BlockStatement
src/web-api/xcutting/user-presenter.mapper.ts:6:41
 import { UserResponse } from '@/web-api/xcutting';
 
 export class UserPresenter {
-    static of(user: User): UserResponse {
-        return new UserResponse({
-            id: user.id,
-            name: user.name,
-            email: user.email,
-            password: user.password,
-            fullname: user.fullname,
-            createdAt: DateTimeHelper.toLocalISOString(user.createdAt),
-        });
-    }
+    static of(user: User): UserResponse {}
 }
 
killedBy: POST /users should return 201 Created with Body when the user is successfully registered
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"createdAt": "2022-12-27 00:00:00", "email": "john.smith.zero@xyz.com", "fullname": "John Smith Zero", "id": 1, "name": "jszero", "password": "P@ssw0rd"}
Received: ""
